#include <stddef.h>
#include <string.h>

/* Разработать программу solution, обеспечивающую загрузку динамической библиотеки в режиме исполнения.
 * При запуске, программе передается имя динамической библиотеки, имя функции которая должна быть вызвана, и ее аргумент.
 * Функция в библиотеке принимает на вход int и возвращает int.
 * Результат, возвращаемый функцией, должен быть выведен отдельной строкой (оканчиваться символом новой строки \n) в stdout.
 */

int stringStat(const char *string, size_t multiplier, int *count) {
    return 0;
}
